<template>
  <div>
    <h1>Тестовое задание ООО «Автотехника»</h1>
    <p>
      <b>Часть 1</b><br />
      Реализовать полностью кастомный “RangeInput” аналог input type="range" На
      выходе это должен быть Vue-component (не npm пакет, а просто компонент).
      Работать должен как на десктопе так и на мобильной версии. На вход
      компонента должно поступать начальное значение процента. Компонент должен
      иметь возможность использовать директиву v-model (естественно, что в
      событии должен передаваться текущий процент). Цветовая палитра не
      принципиальна.
    </p>
    <router-link :to="{ name: 'Users' }">Реализация</router-link>
    <p>
      <b>Часть 2</b><br />
      При помощи Vue.js реализовать список пользователей с поиском по имени. С
      возможностью удаления/добавления пользователя. И переходом на подробную
      страницу о пользователе (Просто что бы понять как вы работаете с
      навигацией). Данный для инициализации можно взять по адресу
      https://reqres.in/api/users?page=1 Либо можете использовать любой другой
      удобный для вас сервис. Удаление и добавление не должно работать через
      REST! Ссылку использовать только как начальный источник информации.
    </p>
    <router-link :to="{ name: 'RangeInput' }">Реализация</router-link>
  </div>
</template>
